https://www.kaggle.com/c/titanic
https://www.kaggle.com/alexisbcook/titanic-tutorial   
https://app.dataquest.io/m/289/introduction-to-numpy/7/selecting-columns-and-custom-slicing-ndarrays
https://neurohive.io/ru/osnovy-data-science/razbor-resheniya-zadachi-titanik-na-kaggle-dlya-nachinajushhih/
https://habr.com/ru/post/274171/
https://habr.com/ru/post/202090/

In [1]:
import csv
import numpy as np
import pandas as pd
import seaborn as sns
trd = pd.read_csv('train.csv')
tsd = pd.read_csv('test.csv')

#Сливаем открытые фреймы в один
td = pd.concat([trd, tsd], ignore_index=True, sort = False)

In [2]:
td.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0.0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1.0,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1.0,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [ ]:
td.info()

In [ ]:
#Тепловая карта пропущенных значений
td.isnull().sum()
sns.heatmap(td.isnull(), cbar = False).set_title("Missing values heatmap")

In [ ]:
td['SibSp'].value_counts()

In [ ]:
td.describe(include="all")

In [ ]:
td.loc[:10, ["Age", "Sex"]]

In [ ]:
td["Age"].unique()
td["Age"].mean()
td_age = titanic['Age'].value_counts()
age_24_30 = td_age.loc[[24.00, 30.00]]

In [ ]:
#Зависимая и независимые переменные. Сортировка выживших по полу и возрасту
td[["Survived", "Age", "Sex"]].value_counts().loc[1]

In [ ]:
#Зависимая и независимые переменные. Средняя доля выживших и среднее по возрасту и цене билета
td[["Survived", "Age", "Fare"]].mean(axis=0)

In [ ]:
td.max(numeric_only = True)

In [ ]:
#Получение строк по заданным значениям столбцов
td[td["Sex"].isin(['male'])]

In [ ]:
#Сортировка
td.sort_values('Age', ascending=False)

In [ ]:
#Агрегирование. Подсчет количества записей
td.groupby('Fare').count()